layer {
  name: 'data'
  type: 'Data'
  top: 'data'
  top: 'label'
  include {
    phase: TRAIN
 }
 transform_param {
   mean_value: 127.5
   mean_value: 127.5
   mean_value: 127.5
   scale: 0.0078125
   mirror: true
 }
 data_param {
   source: "/data/zeng/webface_160x160_train_lmdb"
   backend: LMDB
   batch_size : 4
  }
}
layer {
  name: 'data'
  type: 'Data'
  top: 'data'
  top: 'label'
  include {
    phase: TEST
 }
 transform_param {
   mean_value: 127.5
   mean_value: 127.5
   mean_value: 127.5
   scale: 0.0078125
   mirror: true
 }
 data_param {
   source: "/data/zeng/webface_160x160_val_lmdb"
   backend: LMDB
   batch_size : 4
  }
}
layer {
  name: "stem/conv1"
  bottom: "data"
  top: "stem/conv1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 2
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "stem/conv1_bn"
  type: "BatchNorm"
  bottom: "stem/conv1"
  top: "stem/conv1"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "stem/conv1_scale"
  type: "Scale"
  bottom: "stem/conv1"
  top: "stem/conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stem/conv1_relu"
  type: "ReLU"
  bottom: "stem/conv1"
  top: "stem/conv1"
}
layer {
  name: "stem/conv2"
  bottom: "stem/conv1"
  top: "stem/conv2"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "stem/conv2_bn"
  type: "BatchNorm"
  bottom: "stem/conv2"
  top: "stem/conv2"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "stem/conv2_scale"
  type: "Scale"
  bottom: "stem/conv2"
  top: "stem/conv2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stem/conv2_relu"
  type: "ReLU"
  bottom: "stem/conv2"
  top: "stem/conv2"
}
layer {
  name: "stem/conv3"
  bottom: "stem/conv2"
  top: "stem/conv3"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 64
    kernel_size: 3
    stride: 1
    pad: 1
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "stem/conv3_bn"
  type: "BatchNorm"
  bottom: "stem/conv3"
  top: "stem/conv3"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "stem/conv3_scale"
  type: "Scale"
  bottom: "stem/conv3"
  top: "stem/conv3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stem/conv3_relu"
  type: "ReLU"
  bottom: "stem/conv3"
  top: "stem/conv3"
}
layer {
  name: "stem/pool1"
  bottom: "stem/conv3"
  top: "stem/pool1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "stem/conv4"
  bottom: "stem/pool1"
  top: "stem/conv4"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 80
    kernel_size: 1
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "stem/conv4_bn"
  type: "BatchNorm"
  bottom: "stem/conv4"
  top: "stem/conv4"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "stem/conv4_scale"
  type: "Scale"
  bottom: "stem/conv4"
  top: "stem/conv4"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stem/conv4_relu"
  type: "ReLU"
  bottom: "stem/conv4"
  top: "stem/conv4"
}
layer {
  name: "stem/conv5"
  bottom: "stem/conv4"
  top: "stem/conv5"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 192
    kernel_size: 3
    stride: 1
    pad: 1
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "stem/conv5_bn"
  type: "BatchNorm"
  bottom: "stem/conv5"
  top: "stem/conv5"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "stem/conv5_scale"
  type: "Scale"
  bottom: "stem/conv5"
  top: "stem/conv5"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stem/conv5_relu"
  type: "ReLU"
  bottom: "stem/conv5"
  top: "stem/conv5"
}
layer {
  name: "stem/conv6"
  bottom: "stem/conv5"
  top: "stem/conv6"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 256
    kernel_size: 3
    stride: 2
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "stem/conv6_bn"
  type: "BatchNorm"
  bottom: "stem/conv6"
  top: "stem/conv6"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "stem/conv6_scale"
  type: "Scale"
  bottom: "stem/conv6"
  top: "stem/conv6"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stem/conv6_relu"
  type: "ReLU"
  bottom: "stem/conv6"
  top: "stem/conv6"
}
layer {
  name: "inception_resnet_v1_blockA/conv1/1b/1x1"
  bottom: "stem/conv6"
  top: "inception_resnet_v1_blockA/conv1/1b/1x1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 1
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv1/1b/1x1_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv1/1b/1x1"
  top: "inception_resnet_v1_blockA/conv1/1b/1x1"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv1/1b/1x1_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv1/1b/1x1"
  top: "inception_resnet_v1_blockA/conv1/1b/1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv1/1b/1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv1/1b/1x1"
  top: "inception_resnet_v1_blockA/conv1/1b/1x1"
}
layer {
  name: "inception_resnet_v1_blockA/conv1/2b/1x1"
  bottom: "stem/conv6"
  top: "inception_resnet_v1_blockA/conv1/2b/1x1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 1
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv1/2b/1x1_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv1/2b/1x1"
  top: "inception_resnet_v1_blockA/conv1/2b/1x1"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv1/2b/1x1_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv1/2b/1x1"
  top: "inception_resnet_v1_blockA/conv1/2b/1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv1/2b/1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv1/2b/1x1"
  top: "inception_resnet_v1_blockA/conv1/2b/1x1"
}
layer {
  name: "inception_resnet_v1_blockA/conv1/2b/3x3"
  bottom: "inception_resnet_v1_blockA/conv1/2b/1x1"
  top: "inception_resnet_v1_blockA/conv1/2b/3x3"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 1
    pad: 1
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv1/2b/3x3_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv1/2b/3x3"
  top: "inception_resnet_v1_blockA/conv1/2b/3x3"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv1/2b/3x3_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv1/2b/3x3"
  top: "inception_resnet_v1_blockA/conv1/2b/3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv1/2b/3x3_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv1/2b/3x3"
  top: "inception_resnet_v1_blockA/conv1/2b/3x3"
}
layer {
  name: "inception_resnet_v1_blockA/conv1/3b/1x1"
  bottom: "stem/conv6"
  top: "inception_resnet_v1_blockA/conv1/3b/1x1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 1
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv1/3b/1x1_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv1/3b/1x1"
  top: "inception_resnet_v1_blockA/conv1/3b/1x1"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv1/3b/1x1_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv1/3b/1x1"
  top: "inception_resnet_v1_blockA/conv1/3b/1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv1/3b/1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv1/3b/1x1"
  top: "inception_resnet_v1_blockA/conv1/3b/1x1"
}
layer {
  name: "inception_resnet_v1_blockA/conv1/3b/3x3_a"
  bottom: "inception_resnet_v1_blockA/conv1/3b/1x1"
  top: "inception_resnet_v1_blockA/conv1/3b/3x3_a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 1
    pad: 1
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv1/3b/3x3_a_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv1/3b/3x3_a"
  top: "inception_resnet_v1_blockA/conv1/3b/3x3_a"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv1/3b/3x3_a_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv1/3b/3x3_a"
  top: "inception_resnet_v1_blockA/conv1/3b/3x3_a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv1/3b/3x3_a_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv1/3b/3x3_a"
  top: "inception_resnet_v1_blockA/conv1/3b/3x3_a"
}
layer {
  name: "inception_resnet_v1_blockA/conv1/3b/3x3_b"
  bottom: "inception_resnet_v1_blockA/conv1/3b/3x3_a"
  top: "inception_resnet_v1_blockA/conv1/3b/3x3_b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 1
    pad: 1
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv1/3b/3x3_b_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv1/3b/3x3_b"
  top: "inception_resnet_v1_blockA/conv1/3b/3x3_b"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv1/3b/3x3_b_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv1/3b/3x3_b"
  top: "inception_resnet_v1_blockA/conv1/3b/3x3_b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv1/3b/3x3_b_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv1/3b/3x3_b"
  top: "inception_resnet_v1_blockA/conv1/3b/3x3_b"
}
layer{
  name: "inception_resnet_v1_blockA/conv1/concat"
  type: "Concat"
  bottom: "inception_resnet_v1_blockA/conv1/1b/1x1"
  bottom: "inception_resnet_v1_blockA/conv1/2b/3x3"
  bottom: "inception_resnet_v1_blockA/conv1/3b/3x3_b"
  top: "inception_resnet_v1_blockA/conv1/concat"
}
layer {
  name: "inception_resnet_v1_blockA/conv1/conv_up"
  bottom: "inception_resnet_v1_blockA/conv1/concat"
  top: "inception_resnet_v1_blockA/conv1/conv_up"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 256
    kernel_size: 1
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.200 }
    bias_filler { type: "constant" value: 0.010 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv1/eltwise"
  bottom: "stem/conv6"
  bottom: "inception_resnet_v1_blockA/conv1/conv_up"
  top: "inception_resnet_v1_blockA/conv1/eltwise"
  type: "Eltwise"
  eltwise_param {
    operation: 1
    coeff: 1.000
    coeff: 0.170
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv1/ReLU"
  bottom: "inception_resnet_v1_blockA/conv1/eltwise"
  top: "inception_resnet_v1_blockA/conv1/eltwise"
  type: "ReLU"
}
layer {
  name: "inception_resnet_v1_blockA/conv2/1b/1x1"
  bottom: "inception_resnet_v1_blockA/conv1/eltwise"
  top: "inception_resnet_v1_blockA/conv2/1b/1x1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 1
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv2/1b/1x1_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv2/1b/1x1"
  top: "inception_resnet_v1_blockA/conv2/1b/1x1"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv2/1b/1x1_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv2/1b/1x1"
  top: "inception_resnet_v1_blockA/conv2/1b/1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv2/1b/1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv2/1b/1x1"
  top: "inception_resnet_v1_blockA/conv2/1b/1x1"
}
layer {
  name: "inception_resnet_v1_blockA/conv2/2b/1x1"
  bottom: "inception_resnet_v1_blockA/conv1/eltwise"
  top: "inception_resnet_v1_blockA/conv2/2b/1x1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 1
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv2/2b/1x1_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv2/2b/1x1"
  top: "inception_resnet_v1_blockA/conv2/2b/1x1"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv2/2b/1x1_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv2/2b/1x1"
  top: "inception_resnet_v1_blockA/conv2/2b/1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv2/2b/1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv2/2b/1x1"
  top: "inception_resnet_v1_blockA/conv2/2b/1x1"
}
layer {
  name: "inception_resnet_v1_blockA/conv2/2b/3x3"
  bottom: "inception_resnet_v1_blockA/conv2/2b/1x1"
  top: "inception_resnet_v1_blockA/conv2/2b/3x3"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 1
    pad: 1
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv2/2b/3x3_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv2/2b/3x3"
  top: "inception_resnet_v1_blockA/conv2/2b/3x3"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv2/2b/3x3_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv2/2b/3x3"
  top: "inception_resnet_v1_blockA/conv2/2b/3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv2/2b/3x3_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv2/2b/3x3"
  top: "inception_resnet_v1_blockA/conv2/2b/3x3"
}
layer {
  name: "inception_resnet_v1_blockA/conv2/3b/1x1"
  bottom: "inception_resnet_v1_blockA/conv1/eltwise"
  top: "inception_resnet_v1_blockA/conv2/3b/1x1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 1
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv2/3b/1x1_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv2/3b/1x1"
  top: "inception_resnet_v1_blockA/conv2/3b/1x1"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv2/3b/1x1_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv2/3b/1x1"
  top: "inception_resnet_v1_blockA/conv2/3b/1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv2/3b/1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv2/3b/1x1"
  top: "inception_resnet_v1_blockA/conv2/3b/1x1"
}
layer {
  name: "inception_resnet_v1_blockA/conv2/3b/3x3_a"
  bottom: "inception_resnet_v1_blockA/conv2/3b/1x1"
  top: "inception_resnet_v1_blockA/conv2/3b/3x3_a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 1
    pad: 1
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv2/3b/3x3_a_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv2/3b/3x3_a"
  top: "inception_resnet_v1_blockA/conv2/3b/3x3_a"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv2/3b/3x3_a_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv2/3b/3x3_a"
  top: "inception_resnet_v1_blockA/conv2/3b/3x3_a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv2/3b/3x3_a_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv2/3b/3x3_a"
  top: "inception_resnet_v1_blockA/conv2/3b/3x3_a"
}
layer {
  name: "inception_resnet_v1_blockA/conv2/3b/3x3_b"
  bottom: "inception_resnet_v1_blockA/conv2/3b/3x3_a"
  top: "inception_resnet_v1_blockA/conv2/3b/3x3_b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 1
    pad: 1
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv2/3b/3x3_b_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv2/3b/3x3_b"
  top: "inception_resnet_v1_blockA/conv2/3b/3x3_b"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv2/3b/3x3_b_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv2/3b/3x3_b"
  top: "inception_resnet_v1_blockA/conv2/3b/3x3_b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv2/3b/3x3_b_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv2/3b/3x3_b"
  top: "inception_resnet_v1_blockA/conv2/3b/3x3_b"
}
layer{
  name: "inception_resnet_v1_blockA/conv2/concat"
  type: "Concat"
  bottom: "inception_resnet_v1_blockA/conv2/1b/1x1"
  bottom: "inception_resnet_v1_blockA/conv2/2b/3x3"
  bottom: "inception_resnet_v1_blockA/conv2/3b/3x3_b"
  top: "inception_resnet_v1_blockA/conv2/concat"
}
layer {
  name: "inception_resnet_v1_blockA/conv2/conv_up"
  bottom: "inception_resnet_v1_blockA/conv2/concat"
  top: "inception_resnet_v1_blockA/conv2/conv_up"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 256
    kernel_size: 1
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.200 }
    bias_filler { type: "constant" value: 0.010 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv2/eltwise"
  bottom: "inception_resnet_v1_blockA/conv1/eltwise"
  bottom: "inception_resnet_v1_blockA/conv2/conv_up"
  top: "inception_resnet_v1_blockA/conv2/eltwise"
  type: "Eltwise"
  eltwise_param {
    operation: 1
    coeff: 1.000
    coeff: 0.170
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv2/ReLU"
  bottom: "inception_resnet_v1_blockA/conv2/eltwise"
  top: "inception_resnet_v1_blockA/conv2/eltwise"
  type: "ReLU"
}
layer {
  name: "inception_resnet_v1_blockA/conv3/1b/1x1"
  bottom: "inception_resnet_v1_blockA/conv2/eltwise"
  top: "inception_resnet_v1_blockA/conv3/1b/1x1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 1
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv3/1b/1x1_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv3/1b/1x1"
  top: "inception_resnet_v1_blockA/conv3/1b/1x1"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv3/1b/1x1_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv3/1b/1x1"
  top: "inception_resnet_v1_blockA/conv3/1b/1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv3/1b/1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv3/1b/1x1"
  top: "inception_resnet_v1_blockA/conv3/1b/1x1"
}
layer {
  name: "inception_resnet_v1_blockA/conv3/2b/1x1"
  bottom: "inception_resnet_v1_blockA/conv2/eltwise"
  top: "inception_resnet_v1_blockA/conv3/2b/1x1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 1
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv3/2b/1x1_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv3/2b/1x1"
  top: "inception_resnet_v1_blockA/conv3/2b/1x1"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv3/2b/1x1_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv3/2b/1x1"
  top: "inception_resnet_v1_blockA/conv3/2b/1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv3/2b/1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv3/2b/1x1"
  top: "inception_resnet_v1_blockA/conv3/2b/1x1"
}
layer {
  name: "inception_resnet_v1_blockA/conv3/2b/3x3"
  bottom: "inception_resnet_v1_blockA/conv3/2b/1x1"
  top: "inception_resnet_v1_blockA/conv3/2b/3x3"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 1
    pad: 1
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv3/2b/3x3_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv3/2b/3x3"
  top: "inception_resnet_v1_blockA/conv3/2b/3x3"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv3/2b/3x3_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv3/2b/3x3"
  top: "inception_resnet_v1_blockA/conv3/2b/3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv3/2b/3x3_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv3/2b/3x3"
  top: "inception_resnet_v1_blockA/conv3/2b/3x3"
}
layer {
  name: "inception_resnet_v1_blockA/conv3/3b/1x1"
  bottom: "inception_resnet_v1_blockA/conv2/eltwise"
  top: "inception_resnet_v1_blockA/conv3/3b/1x1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 1
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv3/3b/1x1_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv3/3b/1x1"
  top: "inception_resnet_v1_blockA/conv3/3b/1x1"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv3/3b/1x1_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv3/3b/1x1"
  top: "inception_resnet_v1_blockA/conv3/3b/1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv3/3b/1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv3/3b/1x1"
  top: "inception_resnet_v1_blockA/conv3/3b/1x1"
}
layer {
  name: "inception_resnet_v1_blockA/conv3/3b/3x3_a"
  bottom: "inception_resnet_v1_blockA/conv3/3b/1x1"
  top: "inception_resnet_v1_blockA/conv3/3b/3x3_a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 1
    pad: 1
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv3/3b/3x3_a_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv3/3b/3x3_a"
  top: "inception_resnet_v1_blockA/conv3/3b/3x3_a"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv3/3b/3x3_a_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv3/3b/3x3_a"
  top: "inception_resnet_v1_blockA/conv3/3b/3x3_a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv3/3b/3x3_a_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv3/3b/3x3_a"
  top: "inception_resnet_v1_blockA/conv3/3b/3x3_a"
}
layer {
  name: "inception_resnet_v1_blockA/conv3/3b/3x3_b"
  bottom: "inception_resnet_v1_blockA/conv3/3b/3x3_a"
  top: "inception_resnet_v1_blockA/conv3/3b/3x3_b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 1
    pad: 1
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv3/3b/3x3_b_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv3/3b/3x3_b"
  top: "inception_resnet_v1_blockA/conv3/3b/3x3_b"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv3/3b/3x3_b_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv3/3b/3x3_b"
  top: "inception_resnet_v1_blockA/conv3/3b/3x3_b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv3/3b/3x3_b_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv3/3b/3x3_b"
  top: "inception_resnet_v1_blockA/conv3/3b/3x3_b"
}
layer{
  name: "inception_resnet_v1_blockA/conv3/concat"
  type: "Concat"
  bottom: "inception_resnet_v1_blockA/conv3/1b/1x1"
  bottom: "inception_resnet_v1_blockA/conv3/2b/3x3"
  bottom: "inception_resnet_v1_blockA/conv3/3b/3x3_b"
  top: "inception_resnet_v1_blockA/conv3/concat"
}
layer {
  name: "inception_resnet_v1_blockA/conv3/conv_up"
  bottom: "inception_resnet_v1_blockA/conv3/concat"
  top: "inception_resnet_v1_blockA/conv3/conv_up"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 256
    kernel_size: 1
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.200 }
    bias_filler { type: "constant" value: 0.010 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv3/eltwise"
  bottom: "inception_resnet_v1_blockA/conv2/eltwise"
  bottom: "inception_resnet_v1_blockA/conv3/conv_up"
  top: "inception_resnet_v1_blockA/conv3/eltwise"
  type: "Eltwise"
  eltwise_param {
    operation: 1
    coeff: 1.000
    coeff: 0.170
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv3/ReLU"
  bottom: "inception_resnet_v1_blockA/conv3/eltwise"
  top: "inception_resnet_v1_blockA/conv3/eltwise"
  type: "ReLU"
}
layer {
  name: "inception_resnet_v1_blockA/conv4/1b/1x1"
  bottom: "inception_resnet_v1_blockA/conv3/eltwise"
  top: "inception_resnet_v1_blockA/conv4/1b/1x1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 1
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv4/1b/1x1_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv4/1b/1x1"
  top: "inception_resnet_v1_blockA/conv4/1b/1x1"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv4/1b/1x1_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv4/1b/1x1"
  top: "inception_resnet_v1_blockA/conv4/1b/1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv4/1b/1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv4/1b/1x1"
  top: "inception_resnet_v1_blockA/conv4/1b/1x1"
}
layer {
  name: "inception_resnet_v1_blockA/conv4/2b/1x1"
  bottom: "inception_resnet_v1_blockA/conv3/eltwise"
  top: "inception_resnet_v1_blockA/conv4/2b/1x1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 1
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv4/2b/1x1_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv4/2b/1x1"
  top: "inception_resnet_v1_blockA/conv4/2b/1x1"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv4/2b/1x1_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv4/2b/1x1"
  top: "inception_resnet_v1_blockA/conv4/2b/1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv4/2b/1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv4/2b/1x1"
  top: "inception_resnet_v1_blockA/conv4/2b/1x1"
}
layer {
  name: "inception_resnet_v1_blockA/conv4/2b/3x3"
  bottom: "inception_resnet_v1_blockA/conv4/2b/1x1"
  top: "inception_resnet_v1_blockA/conv4/2b/3x3"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 1
    pad: 1
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv4/2b/3x3_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv4/2b/3x3"
  top: "inception_resnet_v1_blockA/conv4/2b/3x3"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv4/2b/3x3_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv4/2b/3x3"
  top: "inception_resnet_v1_blockA/conv4/2b/3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv4/2b/3x3_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv4/2b/3x3"
  top: "inception_resnet_v1_blockA/conv4/2b/3x3"
}
layer {
  name: "inception_resnet_v1_blockA/conv4/3b/1x1"
  bottom: "inception_resnet_v1_blockA/conv3/eltwise"
  top: "inception_resnet_v1_blockA/conv4/3b/1x1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 1
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv4/3b/1x1_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv4/3b/1x1"
  top: "inception_resnet_v1_blockA/conv4/3b/1x1"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv4/3b/1x1_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv4/3b/1x1"
  top: "inception_resnet_v1_blockA/conv4/3b/1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv4/3b/1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv4/3b/1x1"
  top: "inception_resnet_v1_blockA/conv4/3b/1x1"
}
layer {
  name: "inception_resnet_v1_blockA/conv4/3b/3x3_a"
  bottom: "inception_resnet_v1_blockA/conv4/3b/1x1"
  top: "inception_resnet_v1_blockA/conv4/3b/3x3_a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 1
    pad: 1
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv4/3b/3x3_a_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv4/3b/3x3_a"
  top: "inception_resnet_v1_blockA/conv4/3b/3x3_a"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv4/3b/3x3_a_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv4/3b/3x3_a"
  top: "inception_resnet_v1_blockA/conv4/3b/3x3_a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv4/3b/3x3_a_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv4/3b/3x3_a"
  top: "inception_resnet_v1_blockA/conv4/3b/3x3_a"
}
layer {
  name: "inception_resnet_v1_blockA/conv4/3b/3x3_b"
  bottom: "inception_resnet_v1_blockA/conv4/3b/3x3_a"
  top: "inception_resnet_v1_blockA/conv4/3b/3x3_b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 1
    pad: 1
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv4/3b/3x3_b_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv4/3b/3x3_b"
  top: "inception_resnet_v1_blockA/conv4/3b/3x3_b"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv4/3b/3x3_b_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv4/3b/3x3_b"
  top: "inception_resnet_v1_blockA/conv4/3b/3x3_b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv4/3b/3x3_b_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv4/3b/3x3_b"
  top: "inception_resnet_v1_blockA/conv4/3b/3x3_b"
}
layer{
  name: "inception_resnet_v1_blockA/conv4/concat"
  type: "Concat"
  bottom: "inception_resnet_v1_blockA/conv4/1b/1x1"
  bottom: "inception_resnet_v1_blockA/conv4/2b/3x3"
  bottom: "inception_resnet_v1_blockA/conv4/3b/3x3_b"
  top: "inception_resnet_v1_blockA/conv4/concat"
}
layer {
  name: "inception_resnet_v1_blockA/conv4/conv_up"
  bottom: "inception_resnet_v1_blockA/conv4/concat"
  top: "inception_resnet_v1_blockA/conv4/conv_up"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 256
    kernel_size: 1
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.200 }
    bias_filler { type: "constant" value: 0.010 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv4/eltwise"
  bottom: "inception_resnet_v1_blockA/conv3/eltwise"
  bottom: "inception_resnet_v1_blockA/conv4/conv_up"
  top: "inception_resnet_v1_blockA/conv4/eltwise"
  type: "Eltwise"
  eltwise_param {
    operation: 1
    coeff: 1.000
    coeff: 0.170
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv4/ReLU"
  bottom: "inception_resnet_v1_blockA/conv4/eltwise"
  top: "inception_resnet_v1_blockA/conv4/eltwise"
  type: "ReLU"
}
layer {
  name: "inception_resnet_v1_blockA/conv5/1b/1x1"
  bottom: "inception_resnet_v1_blockA/conv4/eltwise"
  top: "inception_resnet_v1_blockA/conv5/1b/1x1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 1
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv5/1b/1x1_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv5/1b/1x1"
  top: "inception_resnet_v1_blockA/conv5/1b/1x1"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv5/1b/1x1_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv5/1b/1x1"
  top: "inception_resnet_v1_blockA/conv5/1b/1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv5/1b/1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv5/1b/1x1"
  top: "inception_resnet_v1_blockA/conv5/1b/1x1"
}
layer {
  name: "inception_resnet_v1_blockA/conv5/2b/1x1"
  bottom: "inception_resnet_v1_blockA/conv4/eltwise"
  top: "inception_resnet_v1_blockA/conv5/2b/1x1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 1
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv5/2b/1x1_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv5/2b/1x1"
  top: "inception_resnet_v1_blockA/conv5/2b/1x1"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv5/2b/1x1_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv5/2b/1x1"
  top: "inception_resnet_v1_blockA/conv5/2b/1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv5/2b/1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv5/2b/1x1"
  top: "inception_resnet_v1_blockA/conv5/2b/1x1"
}
layer {
  name: "inception_resnet_v1_blockA/conv5/2b/3x3"
  bottom: "inception_resnet_v1_blockA/conv5/2b/1x1"
  top: "inception_resnet_v1_blockA/conv5/2b/3x3"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 1
    pad: 1
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv5/2b/3x3_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv5/2b/3x3"
  top: "inception_resnet_v1_blockA/conv5/2b/3x3"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv5/2b/3x3_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv5/2b/3x3"
  top: "inception_resnet_v1_blockA/conv5/2b/3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv5/2b/3x3_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv5/2b/3x3"
  top: "inception_resnet_v1_blockA/conv5/2b/3x3"
}
layer {
  name: "inception_resnet_v1_blockA/conv5/3b/1x1"
  bottom: "inception_resnet_v1_blockA/conv4/eltwise"
  top: "inception_resnet_v1_blockA/conv5/3b/1x1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 1
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv5/3b/1x1_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv5/3b/1x1"
  top: "inception_resnet_v1_blockA/conv5/3b/1x1"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv5/3b/1x1_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv5/3b/1x1"
  top: "inception_resnet_v1_blockA/conv5/3b/1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv5/3b/1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv5/3b/1x1"
  top: "inception_resnet_v1_blockA/conv5/3b/1x1"
}
layer {
  name: "inception_resnet_v1_blockA/conv5/3b/3x3_a"
  bottom: "inception_resnet_v1_blockA/conv5/3b/1x1"
  top: "inception_resnet_v1_blockA/conv5/3b/3x3_a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 1
    pad: 1
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv5/3b/3x3_a_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv5/3b/3x3_a"
  top: "inception_resnet_v1_blockA/conv5/3b/3x3_a"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv5/3b/3x3_a_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv5/3b/3x3_a"
  top: "inception_resnet_v1_blockA/conv5/3b/3x3_a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv5/3b/3x3_a_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv5/3b/3x3_a"
  top: "inception_resnet_v1_blockA/conv5/3b/3x3_a"
}
layer {
  name: "inception_resnet_v1_blockA/conv5/3b/3x3_b"
  bottom: "inception_resnet_v1_blockA/conv5/3b/3x3_a"
  top: "inception_resnet_v1_blockA/conv5/3b/3x3_b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 1
    pad: 1
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv5/3b/3x3_b_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_blockA/conv5/3b/3x3_b"
  top: "inception_resnet_v1_blockA/conv5/3b/3x3_b"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv5/3b/3x3_b_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_blockA/conv5/3b/3x3_b"
  top: "inception_resnet_v1_blockA/conv5/3b/3x3_b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv5/3b/3x3_b_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_blockA/conv5/3b/3x3_b"
  top: "inception_resnet_v1_blockA/conv5/3b/3x3_b"
}
layer{
  name: "inception_resnet_v1_blockA/conv5/concat"
  type: "Concat"
  bottom: "inception_resnet_v1_blockA/conv5/1b/1x1"
  bottom: "inception_resnet_v1_blockA/conv5/2b/3x3"
  bottom: "inception_resnet_v1_blockA/conv5/3b/3x3_b"
  top: "inception_resnet_v1_blockA/conv5/concat"
}
layer {
  name: "inception_resnet_v1_blockA/conv5/conv_up"
  bottom: "inception_resnet_v1_blockA/conv5/concat"
  top: "inception_resnet_v1_blockA/conv5/conv_up"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 256
    kernel_size: 1
    stride: 1
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.200 }
    bias_filler { type: "constant" value: 0.010 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv5/eltwise"
  bottom: "inception_resnet_v1_blockA/conv4/eltwise"
  bottom: "inception_resnet_v1_blockA/conv5/conv_up"
  top: "inception_resnet_v1_blockA/conv5/eltwise"
  type: "Eltwise"
  eltwise_param {
    operation: 1
    coeff: 1.000
    coeff: 0.170
  }
}
layer {
  name: "inception_resnet_v1_blockA/conv5/ReLU"
  bottom: "inception_resnet_v1_blockA/conv5/eltwise"
  top: "inception_resnet_v1_blockA/conv5/eltwise"
  type: "ReLU"
}
layer {
  name: "inception_resnet_v1_reduction_A/reduction_A/1b/3x3"
  bottom: "inception_resnet_v1_blockA/conv5/eltwise"
  top: "inception_resnet_v1_reduction_A/reduction_A/1b/3x3"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 384
    kernel_size: 3
    stride: 2
    pad: 1
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_reduction_A/reduction_A/1b/3x3_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_reduction_A/reduction_A/1b/3x3"
  top: "inception_resnet_v1_reduction_A/reduction_A/1b/3x3"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_reduction_A/reduction_A/1b/3x3_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_reduction_A/reduction_A/1b/3x3"
  top: "inception_resnet_v1_reduction_A/reduction_A/1b/3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_reduction_A/reduction_A/1b/3x3_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_reduction_A/reduction_A/1b/3x3"
  top: "inception_resnet_v1_reduction_A/reduction_A/1b/3x3"
}
layer {
  name: "inception_resnet_v1_reduction_A/reduction_A/2b/1x1"
  bottom: "inception_resnet_v1_blockA/conv5/eltwise"
  top: "inception_resnet_v1_reduction_A/reduction_A/2b/1x1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 192
    kernel_size: 1
    stride: 1
    pad: 1
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_reduction_A/reduction_A/2b/1x1_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_reduction_A/reduction_A/2b/1x1"
  top: "inception_resnet_v1_reduction_A/reduction_A/2b/1x1"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_reduction_A/reduction_A/2b/1x1_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_reduction_A/reduction_A/2b/1x1"
  top: "inception_resnet_v1_reduction_A/reduction_A/2b/1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_reduction_A/reduction_A/2b/1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_reduction_A/reduction_A/2b/1x1"
  top: "inception_resnet_v1_reduction_A/reduction_A/2b/1x1"
}
layer {
  name: "inception_resnet_v1_reduction_A/reduction_A/2b/3x3_a"
  bottom: "inception_resnet_v1_reduction_A/reduction_A/2b/1x1"
  top: "inception_resnet_v1_reduction_A/reduction_A/2b/3x3_a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 256
    kernel_size: 3
    stride: 1
    pad: 1
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
  name: "inception_resnet_v1_reduction_A/reduction_A/2b/3x3_a_bn"
  type: "BatchNorm"
  bottom: "inception_resnet_v1_reduction_A/reduction_A/2b/3x3_a"
  top: "inception_resnet_v1_reduction_A/reduction_A/2b/3x3_a"
  batch_norm_param {
    use_global_stats: false
    eps: 0.001
  }
}
layer {
  name: "inception_resnet_v1_reduction_A/reduction_A/2b/3x3_a_scale"
  type: "Scale"
  bottom: "inception_resnet_v1_reduction_A/reduction_A/2b/3x3_a"
  top: "inception_resnet_v1_reduction_A/reduction_A/2b/3x3_a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_resnet_v1_reduction_A/reduction_A/2b/3x3_a_relu"
  type: "ReLU"
  bottom: "inception_resnet_v1_reduction_A/reduction_A/2b/3x3_a"
  top: "inception_resnet_v1_reduction_A/reduction_A/2b/3x3_a"
}
layer {
  name: "inception_resnet_v1_reduction_A/reduction_A/2b/3x3_b"
  bottom: "inception_resnet_v1_reduction_A/reduction_A/2b/3x3_a"
  top: "inception_resnet_v1_reduction_A/reduction_A/2b/3x3_b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 384
    kernel_size: 3
    stride: 2
    pad: 0
    group: 1
    weight_filler { type: "xavier" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
    #engine: CAFFE
  }
}
layer {
